{
  "WritingTask": {
    "1": {
      "0" : "Writing an Email",
      "1": "Write a letter to the manager of the supermarket in about 150-200 words. Your email should do the following things: \n* Say who are you\n* Give details about the accident\n* Suggest how the supermarket could prevent similar accidents.",
      "2": "Write an email to the Airline in about 150-200 words. Your email should do the following things:\n* Problems faced by regular passengers\n* Complain about the poor service",
      "3": "Write an email to the bookseller in about 150-200 words. Your email should do the following things:\n* Complain about service of the online site\n* State about the urgency for the latest edition",
      "4": "Write a letter to the Manager of the hotel in about 150-200 words. Your email should do the following things:\n* Request him to provide the details of the hotel\n* Write about the type of room and any special needs or requests such as a smoking or nonsmoking room",
      "5": "Write an email to the Director of the Zoological Park in about 150-200 words. Your email should do the following things:\n* Give a description of the incident\n* Complain about the short fencing\n* Show your concern for the safety of the visitors",
      "6": "Write an email to the Manager of the theme park in about 150-200 words. Your email should do the following things:\n* Request him to provide the details of the theme park.\n* Write about the cost of the day pass per visitor, and about seasonal discounts.",
      "7": "Write a letter to the old teacher in about 150-200 words. Your email should do the following things:\n* say what job you have applied for \n* explain why you want this job\n* suggest what information the teacher should include",
      "8": "Write a letter to the management of the public transport company in about 150-200 words. In your letter describe the problems\n* Explain how these problems are affecting the public.\n* Suggest some changes that could be made.",
      "9": "Write an email to the website support department in about 150-200 words. Your email should do the following things: \n* What you purchased and when.\n* Exactly how it is different from the website description.\n* How you would like the company to fix the problem.",
      "10": "Write an email to the Manager of the colony in about 150-200 words. Your email should do the following things:\n* Give a description of the chain and the place where you found it.\n* Ask help from the Secretary of the colony in tracing the owner",
      "duration": 27
    },
    "2": {
      "0" : "Responding to survey questions",
      "1": "Your city is conducting a survey to know public opinion if the city should close the central zoo. \nThe city has sent out an opinion survey to see what residents think about it.\nClosing Main city zoo\n\nOption A: City should close the central Zoo.\nOption B: City should not close the central Zoo.",
      "2": "Your College management is conducting a survey to replace paper books with ebooks. \nThe management has sent out an opinion survey to see what students feel about the given options\nBook reading Survey:\n\nOption A: Reading e-books is more advantageous than reading paper-based books. \nOption B: Paper books are better then e-books.",
      "3": "Your company is thinking of creating a facility in one of its floors. The management of your company is \nsurveying your opinion on what to have. The major question is whether the company should build a gym or a Cafeteria.\nNew facility survey:\n\nOption A: Gym: This gym would include table tennis, exercising equipment, and shower rooms.\nOption B: Child care center: This center would include a small playground, a small indoor rides.",
      "4": "You live in a small city. City administration is planning to allocate funds for two possible projects.\nYour City is funding ONE of the given projects:\n\nOption A: Option A: Bike Lanes: Planning to build new separate lanes for bikers\nOption B: Renovate gym: Planning to add a swimming pool and spa centre in existing gym",
      "5": "Your city is planning to develop new sports complex. \nThe city has sent out an opinion survey to see what residents would like to have built-in that area.\nSports Complex development survey:\n\nOption A: Athletic tracks and supports Complex: Sports complex will mainly provide facilities to Athletes. \nOption B: Baseball ground: Authorities will develop ground with a good sitting capacity",
      "6": "You are working in a company, your company is planning to introduce new payment system. \nCompany has sent out an opinion survey to know what is the preference of the employees.\nPayment schedule survey:\n\nOption A: Monthly payments: Company will pay at the end of the month.\nOption B: Daily payments: All employees will be paid on daily basis.",
      "7": "You live in a country where government is planning to impose ban on wearing religious symbols in public. \nThe government has sent out an opinion survey to see what residents would like to say on this issue.\nRestrictions on Religion Survey:\n\nOption A:People have the right to practice any religion.\nOption B: Religion is root to many problems.",
      "8": "A local newspaper is conducting a survey to know whether their paper should have more news or more \ndiscounts and offers.\nLocal News Paper Survey:\n\nOption A: Your newspaper should have more Local and International news, then discount coupons, etc.\nOption B: You think you can access news online but you need more Discount coupons and offers section.",
      "9": "Hostel management has decided to upgrade the security in and around the campus. \nThe management has sent out an opinion survey to see what residents would like to have as new security measure.\nYou are residing in a College hostel :\n\nOption A: New HD Night Vision Cameras covering the area around the hostel.\nOption B: Installing biometric locks on the doors.",
      "10": "Government is seeking public opinion to find out the reasons for the chronic issue of violence and bullying in schools. \nWhat do you think is the actual reason.\nSchool violence survey:\n\nOption A: Under-reporting of the incidents:\nOption B: The school administrator's fear of reputation risk.",
      "duration": 26
    }
  },
  "SpeakingTask": {
    "0": {
      "0": "Practice Question",
      "1": "Talk about your best friend",
      "duration": 60,
      "preptime": 30
    },
    "1": {
      "0": "Giving Advice",
      "1": "Your friend is looking for a new-generation laptop.",
      "2": "Your brother is planning to buy a new car. Advise him about the different cars available in your city",
      "3": "A friend is looking for a job change. Advise him about different ways he can find a new job.",
      "4": "A friend is looking for a summer job. Advise him about different ways he can find work for the summer",
      "5": "Your younger sister is not sure about choosing a medical or engineering stream. Advise her.",
      "6": "A brother is planning to buy a new car. Advise him about the different cars available in your city.",
      "7": "Your brother is planning to shift to Canada. Advise him to find a reliable immigration agency.",
      "8": "Your friend is looking for a good place to eat in your city.",
      "9": "Your younger sister is planning to go for higher studies abroad. \nGive her a piece of advice to choose the best destination country for higher studies.",
      "10": "Your friend is desperate to invest in Bitcoins. Advise him about cryptocurrency.",
      "duration": 90,
      "preptime": 30
    },
    "2": {
      "0": "Talking about a Personal Experience",
      "1": "Do you think your College Experience Has been most valuable for you and has taught you many useful lessons? \nGive reasons for your thoughts.",
      "2": "Talk about a great time you had in your school. Maybe you can talk about a farewell party, \nsomething you did together at school, a time you traveled with school friends, or anything else you can remember. What happened and why was it memorable?",
      "3": "Talk about your first social media account. \nMaybe you can talk about the platform on which you created your account. What happened and why was it memorable?",
      "4": "Talk about an unexplained event that you witnessed. \nMaybe you can talk about something you saw on the way home or some other place. What happened and why was it memorable?",
      "5": "Talk about your first online shopping experience. \nMaybe you can talk about a good deal you had or what you bought. What happened and why was it memorable?",
      "6": "Talk about the first time you were home alone. \nMaybe you can talk about the fear or fun you had on that day. What happened and why was it memorable?",
      "7": "Share your personal experience, when you have worked as a valuable team member for some social cause. \nHow do you feel working in a Team Environment?",
      "8": "Share your own experience with the new driving test. You think it easier to pass a test now. \nHow long you practised before appearing for the test. How supportive was your family and friends?",
      "9": "Talk about the most unfortunate event ever happened to you. Talk about your family, \nhow they supported you at that particular time. What happened and why was it memorable?",
      "10": "Speak about a situation where your communication skills made a difference to a situation.",
      "duration": 60,
      "preptime": 30
    },
    "3": {
      "0": "Describing a Scene",
      "1": "Describe some things that are happening in the picture as well as you can. \nThe person with whom you are speaking cannot see the picture",
      "2": "Describe some things that are happening in the picture as well as you can. \nThe person with whom you are speaking cannot see the picture",
      "3": "Describe some things that are happening in the picture as well as you can. \nThe person with whom you are speaking cannot see the picture",
      "4": "Describe some things that are happening in the picture as well as you can. \nThe person with whom you are speaking cannot see the picture",
      "5": "Describe some things that are happening in the picture as well as you can. \nThe person with whom you are speaking cannot see the picture",
      "6": "Describe some things that are happening in the picture as well as you can. \nThe person with whom you are speaking cannot see the picture",
      "7": "Describe some things that are happening in the picture as well as you can. \nThe person with whom you are speaking cannot see the picture",
      "8": "Describe some things that are happening in the picture as well as you can. \nThe person with whom you are speaking cannot see the picture",
      "9": "Describe some things that are happening in the picture as well as you can. \nThe person with whom you are speaking cannot see the picture",
      "10": "Describe some things that are happening in the picture as well as you can. \nThe person with whom you are speaking cannot see the picture",
      "duration": 60,
      "preptime": 30
    },
    "4": {
      "0": "Making Predections",
      "1": "In this picture, what do you think will most probably happen next?",
      "2": "In this picture, what do you think will most probably happen next?",
      "3": "In this picture, what do you think will most probably happen next?",
      "4": "In this picture, what do you think will most probably happen next?",
      "5": "In this picture, what do you think will most probably happen next?",
      "6": "In this picture, what do you think will most probably happen next?",
      "7": "In this picture, what do you think will most probably happen next?",
      "8": "In this picture, what do you think will most probably happen next?",
      "9": "In this picture, what do you think will most probably happen next?",
      "10": "In this picture, what do you think will most probably happen next?",
      "duration": 60,
      "preptime": 30
    },
    "5": {
      "0": "Comparing and Persuading",
      "1": "You have some extra money at the end of the year. You are thinking of a smart way to spend it. \nPersonally, you want to gift yourself a home, however, you are considering being generous and giving it all to charity as well.\nPick one of these two options. \nOn the next page, you will persuade your spouse to consider your option versus his/hers.",
      "1_2": "Your partner prefers using the money to go on vacations instead. Convince him/her that your option is better.",
      "2": "You are planning a vacation to a nearby city. You are considering either a plane or a train for the round trip.\nPick one of these two options. \nOn the next page, you will persuade your friends to consider your option versus theirs.",
      "2_2": "Your friends would prefer carpooling with others instead. Convince them why your option would make more sense.",
      "3": "You have decided to pick one main diet source that you can stick with. The choice comes between protein-based \n foods or vegan options. \nPick one of these two options. \nOn the next page, you will persuade your friend that your option is better than his/her.",
      "3_2": "Your friend would rather have you eat fast food instead. Convince him/her why your option would make more sense.",
      "4": "Your friend is looking for a new hobby and she prefers something that will help her fitness goals. \nYou instantly thought of basketball and swimming. \nPick one of these two options. \nOn the next page, you will persuade your friend why your option is better than hers.",
      "4_2": "Your friend would rather go to the gym and workout. Explain to her why your option may be better.",
      "5": "You have some extra time on your hands now that your school exams are done.You are wondering if you should \nuse that extra time and put it towards further study or if you should rather just relax with some social media activities.\nPick one of these two options. \nOn the next page, you will persuade your parents to consider your option versus their preference.",
      "5_2": "Your parents think that outdoor sports would be a better choice. Convince them that your option is better.",
      "6": "You have some extra money at the end of the year. You are thinking of a smart way to spend it. \nPersonally, you want to gift yourself a home, however, you are considering being generous and giving it all to charity as well.\nPick one of these two options. \nOn the next page, you will persuade your spouse to consider your option versus his/hers.",
      "6_2": "Your partner prefers using the money to go on vacations instead. Convince him/her that your option is better.",
      "7": "You are planning a vacation to a nearby city. You are considering either a plane or a train for the round trip.\nPick one of these two options. \nOn the next page, you will persuade your friends to consider your option versus theirs.",
      "7_2": "Your friends would prefer carpooling with others instead. Convince them why your option would make more sense.",
      "8": "You have decided to pick one main diet source that you can stick with. The choice comes between protein-based \nfoods or vegan options.\nPick one of these two options. \nOn the next page, you will persuade your friend that your option is better than his/her.",
      "8_2": "Your friend would rather have you eat fast food instead. Convince him/her why your option would make more sense.",
      "9": "Your friend is looking for a new hobby and she prefers something that will help her fitness goals. You instantly thought of basketball and swimming.\nPick one of these two options. \nOn the next page, you will persuade your friend why your option is better than hers.",
      "9_2": "Your friend would rather go to the gym and workout. Explain to her why your option may be better.",
      "10": "You have some extra time on your hands now that your school exams are done.You are wondering if you should \nuse that extra time and put it towards further study or if you should rather just relax with some social media activities.\nPick one of these two options. \nOn the next page, you will persuade your parents to consider your option versus their preference.",
      "10_2": "Your parents think that outdoor sports would be a better choice. Convince them that your option is better.",
      "duration": 60,
      "preptime": 60
    },
    "6": {
      "0": "Dealing with a Difficult Situation",
      "1": "Your friend is planning to pursue his studies in your country. He is planning to stay with your family for 6 months. \nYour family feels it will be difficult for them to accommodate your friend for 6 months.",
      "2": "Your cousin is planning to start a new business in partnership with your brother. \nBut your brother who is an established businessman is not interested in starting a new venture with your cousin.",
      "3": "Your brother is looking to buy a new house this year. Parents want him to stay with them in your family \nhouse as you are working in other cities.",
      "4": "Your younger brother is interested in joining guitar classes. But your mother told him to join language classes. \nShe feels learning guitar is wastage of time. Your brother does not agree and says the guitar is his passion.",
      "5": "Your brother is looking to buy a new personal computer. Parents want him to buy a laptop, \nwhich he may carry to his college.",
      "6": "Your childhood friend is visiting your place tomorrow. \nBut you have planned a 5 days vacation with your family and are scheduled to leave today.",
      "7": "Your brother is looking to buy a new house this year. \nParents want him to stay with them in your family house as you are working in other cities.",
      "8": "Your cousin is planning to start a new business in partnership with your brother. \nBut your brother who is an established businessman is not interested in starting a new venture with your cousin.",
      "9": "Your boss told you to work on the weekend, but you have promised your mother, \nyou will visit her this weekend.",
      "10": "Your friend wants to have tattoos on her face, but her parents are not allowing her. \nShe asked for your help to convince her parents for the same.",
      "duration": 60,
      "preptime": 60
    },
    "7": {
      "0": "Expressing Opinions",
      "1": "In the age of laptops and iPads, Do you think Hand writing is still important?",
      "2": "All cars should be electric in order to save the environment. \nPeople who disagree should have to pay extra environmental fees. Do you agree?",
      "3": "Do you think dictionaries are useful for learning a language? Explain your reasons.",
      "4": "Do you think experimentation on animals for scientific purposes is justified? Explain your reasons.",
      "5": "Do you think beauty is important in our society? Explain your reasons",
      "6": "Do you think celebrities are good role models? Explain your reasons.",
      "7": "Do you think consumerism is a positive or a negative development? Explain your reasons.",
      "8": "Actors and singers should be paid the same as day to-day workers. \nTo what extent do you agree with this statement?",
      "9": "Vacation pay should be eliminated as it is a burden on the employer as well as businesses. \nWhat is your opinion?",
      "10": "Customers should pay a fee whenever they return or exchange goods due to the extra work the staff has to do. \nWhat is your opinion on this?",
      "duration": 90,
      "preptime": 30
    },
    "8": {
      "0": "Describing an Unusual Situation",
      "1": "Explain the picture to your friend Samuel.",
      "2": "You saw a strange animal in a city zoo. Tell your brother about that strange animal on the phone.",
      "3": "You are in an Art gallery you see a picture that is beautiful but expensive. Phone a member of your family. \nProvide a full and clear description of the picture and ask if you can buy that picture.",
      "4": "You are at the Gadget shop in your city. Talk to your father on phone and tell him about the \ngadget you feel is most attractive to you.",
      "5": "You come across a picture in the art gallery. Explain the picture to your brother Billy.",
      "6": "You are in a furniture store and you see a table you would like to buy, but the store clerk won’t let you \ntake a photo. Phone a member of your family. Provide a full and clear description of the table and ask if you can buy the table.",
      "7": "You see a group of people playing a sport at a recreation centre. Call your friend Betty and describe in \ndetail what the sport is like and what each player is doing. Ask her if she would be interested in trying this sport sometime.",
      "8": "You are walking through a park near a school when you see some children playing. You think they could get hurt. \nCall the school, tell them exactly what you see, and ask them to send a teacher to the park.",
      "9": "You are shopping for a present for your friend Marcy's birthday next week. \nYou saw an interesting mug in a gift shop. Call your mutual friend Steve and describe in detail \nwhat the mug looks like, and ask if he thinks Marcy would like it.",
      "10": "You are at a tourist site and see some street performers. Call your friend Katia and describe in detail what\nthe performers are doing, and ask her if she would like to see the event.",
      "duration": 60,
      "preptime": 30
    }
  }
}